{
    "blogs-by-category": [
        {
            "id": 20,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "5 steps in managing public speaking anxiety",
            "body": "Everyone has that fear of addressing the public, especially for the first time. We don’t want to make mistakes when we speak in a public gathering. Whatever the cause of your public speaking anxiety, you can overcome it with these five steps:\r\n\r\n1.Face your fear\r\nBefore you resolve any problem you are facing, the first thing is to be realistic and admit that such a problem exists. Acknowledge that it exists, and have faith that you will overcome it. When you become courageous enough to face your fear, then you will overcome it.\r\n\r\n2.Be knowledgeable of what you will deliver\r\nIt will be of great help to you if you know your material thoroughly, not only memorizing it. You have to have good knowledge of the information you want to pass across, the main message and your key points. To be calm and relaxed on stage, just be prepared.\r\n\r\n3.Don’t think it’s all about you\r\nWhen making a public speech or addressing a crowd, we mostly think that everyone is looking at us, and thus this will make us uncomfortable. Before making a public speech, we need to adjust the way we see things. Change your mindset and know that although everybody in the room is looking at us, in reality, half of them are more interested in the message or content we are delivering, while their own thoughts and other irrelevant things carry the rest away. \r\n\r\n4.Interact with your audience\r\nWhen addressing the public, a big way to release the tension in you and free yourself from public speaking anxiety is by interacting with your audience. This can be done by getting them engaged and doing certain things like asking leading questions, bring up a story you can relate to and many more. As you interact with them and in getting them engaged, you’ll surely be more comfortable and your audience too will feel relaxed. One interesting thing you might not know is that interacting with your audience will make you a more engaging and dynamic speaker. \r\n\r\n5.Think about the worst thing that will happen\r\nIn life, when faced with problems, we are often filled with worries and fears, fear of the worst happening to us. It will amuse you to know that just asking yourself of the worst thing that can happen in any problem you face can be a magical way of resolving problems and overcoming fears and worries. Just like in all life problems, asking yourself of the worst thing that will happen when addressing the public will work wonders for you, as it will free you of public speaking anxiety. Fear of your hand shaking, you making mistakes as you deliver your speech, panic, fretting or any other fears can come into your mind. Firstly, it’s unlikely for any of these problem to happen; but what if it happens? Simple, you pick up yourself, dust yourself off and live to fight another day. Making mistakes is part of life and business, so also public speaking.\r\nIn conclusion, you don’t have to worry about public speaking. The above tips will help you out if you have public speaking anxiety.",
            "excerpt": "Everyone has that fear of addressing the public, especially for the first time. We don’t want to make mistakes when we speak in a public gathering.",
            "tags": "anxiety,public speaking",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/5_steps_in_managing_public_speaking_anxiety-5_steps_in_managing_public_speaki_98vxHi1.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:42:44.704970Z",
            "website": null
        },
        {
            "id": 18,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "Top 5 high paying government jobs",
            "body": "The world is growing fast and things are changing. Private sector is one aspect where growth is recorded because more people are learning to become entrepreneurs and self-reliant. Even though the private sector is growing faster than ever, government jobs still remains among the wide known and sought after career choices available to youths and undergrads. There are many factors that attracts youths to government jobs, and the biggest factors are career stability, prestige and social status, amenities and perk structures, excellent pay, and minimum educational qualifications required for different types of jobs.\r\n\r\nWhen it comes to government jobs after schooling, there are vast opportunities available for candidates. Several government agencies and sectors carryout yearly recruitment exercises providing opportunities for government job lovers. If you are longing for a government job, below are top five government jobs that you can choose from:\r\n\r\n1.Administrative services\r\nOne of the most sought after government jobs is the administrative service, and this job is particularly one of the most sought after jobs especially in India. Aspirants have to appear for the annual examination conducted for openings available for this job. In India, Indian administrative services (IAS) officers are generally appointed as the main administrators as district administrators or for a complete governmental department.\r\n\r\n2.Revenue services\r\nThis is the next most sought after job profile. Officers of the revenue services are selected from exams conducted for this purpose. Eligible candidates are appointed under the department for revenue service. Their jobs mainly include collecting and monitoring revenue for security, development and governance. To add to it, top revenue service officers also take advisory part in drafting and formulating the country’s taxation policies. \r\n\r\n3.Foreign service\r\nIf you are attracted to foreign matters and affairs, then it is advisable that you go for Foreign Service. Exams are set for candidates too, and successful candidates will be screened. The duties of Foreign Service officials include conducting diplomatic operation and also formulation and implementation of foreign policy matters for the country.\r\n\r\n4.Police service\r\nNowadays youths are attracted to police service than ever before. We all should know what police officers do; they are responsible for and act as defenders of the law and order at various levels and positions. New recruits start from a level such as Assistant Superintendent of Police where they are generally promoted over the years to Commissioner of Police and Director General of Police, all depending on the situation at hand. Generally, officers of the police services enjoy punitive and investigative powers and other administrative functions.\r\n\r\n5.Staff selection commission jobs\r\nThis agency is responsible for recruiting personnel and staff for the various governmental departments. The SSC organize exams based recruitment for various departments/ministries of the government. This agency conducts various level examinations to recruit candidates for various office and field jobs of the central government.\r\n\r\nThe jobs mention above are mainly related to Indians and students studying in India looking for high paying government jobs should go after any of the above listed courses.",
            "excerpt": "The world is growing fast and things are changing. Private sector is one aspect where growth is recorded because more people are learning to become entrepreneurs and self-reliant.",
            "tags": "jobs,high paying,government jobs",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Top_5_high_paying_government_jobs-Top_five_high_paying_government_jobs.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:40:35.115745Z",
            "website": null
        },
        {
            "id": 16,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "The Scarlet: a Posh boutique hotel in Singapore",
            "body": "Singapore is a lively and exciting city which is both classy and cosmopolitan in addition to hot and slightly naughty. This dynamic character can be utilized to refer to The Scarlet Singapore, an 80-room mischievous ultra-posh resort in Lion City. Scarlet is the property’s muse and fictional character —think about a maid in fishnets, stilettos, and a garter belt. She's the theory which drives the resort’s ethos, layout, and expertise.\r\n\r\nThis property is that of attitude, but its audacious guise, lavish décor, and its bold colours aren't for everybody. Situated in the Ann Siang Hill neighborhood that is fashionable, it's among the best destinations in Singapore for well-known expats who flock to the region throughout the week to get a meal that is nice or during weekends for a few late night fun. Specialty shops, fashionable restaurants, and wine bars surround it, using its labyrinth of hawker stores selling affordable and cheerful dishes and a block away you will find Chinatown. Nearby is the city’s bustling financial district you’ll find businesspeople, as well as women, rushing from one assembly to another.\r\n\r\nScarlet's ruby red façade is unbelievably different from the white and grey colours of its contiguous buildings. The lobby is furnished with velvet high back seats and materials in garnet reds cobalt and chartreuse mustard. An intricate chandelier; bejeweled, dark red and upholstered wall in the reception space; as well as a drawing room with period pieces, lovely antiques, art, and books come together to form this sexy and visually-exciting surroundings.\r\n\r\nThe resort is masterfully hewn from what was once living quarters in the early 1900s for women factory workers. The part of Scarlet is a vivacious host dripping with jewelry, certainly presents from her gentlemen callers that are adoring. This layout theory is interpreted into a property overflowing with opulent and sparkling layers of details.\r\n\r\nThe 75 rooms and five suites are spread over six floors of row houses that are linked. The hallways are very long, sloping and narrow with leather saddle bags on each and every door for keeping a note from the staff or the day's paper. The interesting thing about boutique hotels that are recovered from the past is the fact that no two rooms are alike. Each has differing shapes and a distinct nature, some with verandas that are excellent and walkout patios, other with views of the red rooftops of the surrounding buildings or of the downtown region. However, what they all have in common is their nature that is provocative.\r\n\r\nAll rooms have excellent décor with whimsical and tasteful graphics, king size beds with flitting on high-end, and headboards amenities. The furnishings are practical works of art with swirling plush velvet materials and design details. Named Opulent Swank, Munificent, Splendour and Fire, the five suites offer modern sophistication with a few boasting big balconies and separate sitting rooms.\r\n\r\nThe resort has two notable dining choices with its first being Casa Tartufo: an intimate, family-run Italian restaurant focusing on truffle dishes. It isn't an excessively challenging site but instead an honest and bona fide eatery offering food that is truly excellent. There's a chef's kitchen as good for little soirées or cooking exhibitions. Together with his wife, the eatery’s chef also manage Aria upstairs, an al fresco space -style Italian varieties.\r\n\r\nThe Scarlet is a real boutique property drenched in tradition and history. It is expensive, using a design theory that is powerful, and is ideal for all those looking to escape the foreseeable cookie-cutter hotel experience. Although It’s not for all, that's precisely what causes it to be so intriguing.",
            "excerpt": "Singapore is a lively and exciting city which is both classy and cosmopolitan in addition to hot and slightly naughty.",
            "tags": "singapore,hotel",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/The_Scarlet_a_Posh_boutique_hotel_in_Singapore-The_Scarlet.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:36:05.783807Z",
            "website": null
        },
        {
            "id": 14,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "Check out the world's first underwater tennis court",
            "body": "Dubai doesn't mess in regards to bigger and better things, mainly where tennis is concerned. With the world’s greatest tennis court located 1,000 feet above ground on the Burj Al Arab Hotel’s roof, the Persian Gulf may shortly have the first submerged court.\r\n\r\nEarlier in the year, Poland-based 8 + 8 Concept Studio released their theory plans for an underwater tennis facility that they’re expecting will hold seven courts. Essentially an inverse aquarium, where we’re the pictures reveal enormous curved glass ceilings giving viewers the whole ocean to gaze up at. Based on Arabian Business, 8 + 8 creator Krzysztof Koala sees the $1.7-$2.5 billion job as combining the finest of “technology, ecology and sport.”\r\n\r\nYou can find apparently lots of technical problems which could hinder the performance, like playability and security, but Kotala continues to be planning on moving forward with the concept. Though there has not been any actual news, the architect, and prospective US investors are seemingly now discussing.\r\n\r\nThere better be a fast escape route should they expect us to remain down there, although we adore the thought of seeing a tennis match from beneath the ocean.",
            "excerpt": "Dubai doesn't mess in regards to bigger and better things, mainly where tennis is concerned. With the world’s greatest tennis court located 1,000 feet above ground on the Burj Al Arab Hotel’s roof, the Persian Gulf may shortly have the first submerged court.",
            "tags": "dubai",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Check_out_the_worlds_first_underwater_tennis_court-Check_out_the_worlds_first_Aw0i36J.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:33:51.441962Z",
            "website": null
        },
        {
            "id": 13,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "The Smartbe stroller, a stroller that works like magic! You don’t have to push it",
            "body": "Smart technology is everywhere from thermostats to garments that are wearable, and today it has gotten to the stroller marketplace. The Smartbe stroller doesn't only use detectors and an engine to roll along in front of you, but nonetheless, it also comes with wireless speakers for lullabies, temperature control, a bottle warmer, a baby cam and an antitheft alarm. Plus, in the event you're feeling not comfortable about utilizing it in hands-free mode, it comes with a help-propelled setting that makes it possible to push it and a manual one where you do all of the jobs.\r\n\r\nBoasting a fairly cool sci-fi aesthetic, the intelligent gadget was intended for athletic parents who would like to jog and sprint. When in hands-free mode, it uses detectors to keep a particular distance from the body, which means that the stroller goes wherever you go. Plus, it comes with a motor that’s powerful enough to push it up hills without rolling back. It is possible to change it to manual, in case you would like to shove it yourself, and the assisted setting can support you when it’s feeling a little bit heavy.\r\n\r\nSmartbe offers ten functions which can be controlled with the use of Android/iOS smartphones and smartwatches, including automatic power folding modes and flexible seat arrangements and rocking modes. Now on sale at Indiegogo, the stroller runs . for $2,750",
            "excerpt": "Smart technology is everywhere from thermostats to garments that are wearable, and today it has gotten to the stroller marketplace.",
            "tags": "stroller,smart stroller",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/The_Smartbe_stroller_a_stroller_that_works_like_magic_You_dont_have_to_push_i_cLw610U.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:30:42.605957Z",
            "website": null
        },
        {
            "id": 8,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "Your ultimate guide to best bachelor pad",
            "body": "It is likely every young man's fantasy is to possess his own Bachelor Pad. During the 50's and 60's a Bachelor Pad was considered the greatest property for a young guy that was successful - something that's still applicable now.\r\n\r\nTherefore, if you are single, live on your own and need to impress women, friends and family - you need to read on!\r\n\t\r\nWhat's the \"Bachelor Pad?\"\r\nSimply put, the bachelor pad may be defined as a place in which a single young man dwells alone. \r\nWhat exactly Does a Bachelor Pad Need?\r\nDesigning the bachelor pad that you would like is extremely personal. We've shown up with three simple layout rules to remember organising your living space and when purchasing pieces.\r\n\r\nQuality - Purchase furniture that's made to last. Present production standards are rather inferior in comparison with the norms of preceding generations. \r\n\r\nRelaxation- All furniture that was great was designed with both functionality and appearance in your mind. A furniture piece may not seem bad but can it be comfy? Ensure that before you buy a bed or a seat, that you examine each piece with relaxation at heart.\r\n\r\nStyle - your bachelor pad should reveal your character. From the furniture; for your artwork and CD set as well as the decor, everything needs an individual contact that'll make your bachelor pad distinct and exceptional from the others.\r\n\r\nWhat Do I want within my Bachelor Pad?\r\nAmusement\r\nYour bachelor pad should be amusing - Not only for living there yourself, but also for your pals as well as the women. So at a minimum you require the following:\r\n\r\nA Big Screen TV\r\nWhether it is watching the big match or viewing the most recent hit, every guy wants a big screen TV, and you should have one in your bachelor's pad. \r\n\r\nSound System\r\nTo complement your big screen TV, a state of the art system that is sound is essential. An excellent sound system will take a minimal quantity of space while providing maximum sound. \r\nGames Console\r\nAn amusement system Won’t ever be whole without a games console. Have various games that'll suit every kind of guest.\r\n\r\nFurniture    \r\nCouch - Big, soft and comfy. Your couch is the key characteristic of the family room. Leather couches so are simple to wash and look fashionable. It is where you will spend the majority of your time and effort listening to music, watching TV and relaxing. \r\n\r\nCoffee table - a stylish coffee table is at least as significant as the couch that sits opposite it. Fashionable coffee tables can vary from a steel and wood mix to tables made only of steel and cast iron. Only ensure that the coffee table goes with all the remaining decor.\r\n\r\nKing size bed - So there is no reason to not buy a huge comfy bed; you spend as much as a third of your life asleep. Also, a king size allows enough space for you as well as your guest have some fun and to sprawl out.\r\n\r\nVital Add-Ons\r\nMini bar - You need to possess a bar area off family room or your kitchen. \r\n\r\nWine rack -To finish your mini bar, purchase a pre-built drink center and refrigerated wine cabinet to cool bottles of bubbly as well as other alcoholic beverages.\r\n\r\nWine - You need to have at least a few great bottles of wine accessible. \r\n\r\nNon-alcoholic Beverages - An assortment of drinks needs to be accessible including coffee, tea, milk, fruit juice, soda, and bottled water. \r\n\r\nFood - Bites and Nibbles should be available to your visitors. \r\n\r\nMusic - Your favourite music needs to be accessible in many rooms of your bachelor pad. Build an impressive CD set up and show it in a CD stand that is fine. Alter the music genre of music in your group to satisfy every occasion.\r\n\r\nArtwork - On the wall in your family room, bedroom and perhaps the dining room and toilet according to how large your pad is. \r\n\r\nReading Material - In your coffee table, spread a few of your favourite magazines out. Go for lighter stuff like entertainment, trend company magazines rather than your typical lads mag.\r\n\r\nA collage of images - Get a primary wall in your bachelor pad that is filled with pictures that tell a narrative. Develop a collage of images that reveal when you had been younger, the positions you have been to all over the world, pictures of family and friends and photos of you.\r\n\r\nThese are great tips to make your bachelor's pad look classic. Take them serious, and you'll be glad you did.",
            "excerpt": "It is likely every young man's fantasy is to possess his own Bachelor Pad. During the 50's and 60's a Bachelor Pad was considered the greatest property for a young guy that was successful - something that's still applicable now.",
            "tags": "bachelor pad",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Your_ultimate_guide_to_best_bachelor_pad-Your_ultimate_guide_to_best_bachelor_pad.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:23:23.876966Z",
            "website": null
        },
        {
            "id": 7,
            "category": {
                "id": 5,
                "title": "Lifestyle",
                "categoryDesc": "Evergreen lifestyle blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Lifestyle-Lifestyle.png"
            },
            "title": "How to throw the best bachelor party",
            "body": "The famous bachelor party will be the most anticipated night of a man 's life, except his wedding day, of course. But it is not only yet another night of debauchery that is perfect before marriage for the groom to be, but instead a night for many guys to be just guys.\r\n\r\nAs Best Man, you need this to be a night for the man getting married to enjoy, as well as for all to recall at the same time.\r\n\r\nGroundwork\r\nPreparation for the nighttime has become the most crucial measure -- this is where all of the strategies are laid out for the magic to take place.\r\n\r\nThe guest list\r\nSo that you can make sure that you are not forgetting anyone significant (or inviting others who did not get an invitation in the mail), strategize the guest list with the bridegroom, or, at least, have him study the list himself ahead of time. Include the bridegroom's best friends, relatives and others that only must be invited from politeness.\r\n\r\nNow comes the girls; the essence of a bachelor party is there are no girls. However, that does not mean you cannot have a few of those crazy pals that are female you'll all have had a good time with. I am not talking about inviting the bride's friends -- in no way should the female guests be linked to the bride -- this cannot be stressed enough. Invite some party girls that have no connection to your daily life, the girls who constantly need to be present to get a great time. \r\n\r\nWhere you are going\r\nThis typically comprises of a strip joint, a strip club, oh, and did I mention the club of a gentleman? The nighttime may also involve a restaurant, a casino, his favourite pub, and you also might want to cap off the night time in a hotel room (the best of the best) or rent a penthouse, unless someone is courageous enough to offer his pad.\r\n\r\nTransport\r\nTo be able to order how you will get from place to place, it is crucial that you understand where the party is headed all night -- no designated drivers permitted. To ensure no one needs to be concerned about how much they drank, rent a limousine for your friends, not minding if the champagne is flowing.\r\n\r\nYou have got the peoples; you have got the venues -- what is next?\r\n\r\nAdditional expenses\r\nForewarn the type of staff at every establishment which you're holding a bachelor party so that they will not be surprised when your colleagues begin approaching all the girls present to give them a little spanking as you will most likely be a loud and obnoxious group. Give whoever's in charge a tiny bit of extra coin for specific treatment as soon as you arrive at every celebration place. Including your limousine driver, do it before the night starts.\r\nAlso, ensure that you set aside some funds in the event you're liable for any additional costs.\r\n\r\nFood and beverage\r\nBe sure to have sufficient food and booze to keep everyone smiling, in the event you are spending all the night time in a hotel room or flat. You do not want an elaborate meal; only finger food and lots of bubbly.\r\n\r\nMore things to put into consideration:\r\nMake it a night he will always recall\r\nYou will give the bridegroom something unique to keep in mind the night after, besides making all of the arrangements for the bachelor party. No, not a stripper's phone number, however, a video montage of his life or his relationship past, as an example, you could reveal to everyone in the celebration.\r\n\r\nSimply have fun\r\nSo once all the organizations are done, kick back and revel in the festivities. \r\nDon't forget, the bachelor party isn't likely to make the bridegroom get cold feet, or think about getting married for anxiety about missing the single life. However, it does not mean he cannot get one last taste of it.",
            "excerpt": "The famous bachelor party will be the most anticipated night of a man 's life, except his wedding day, of course.",
            "tags": "bachelor party,party",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/How_to_throw_the_best_bachelor_party-How_to_throw_the_best_bachelor_party.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T06:22:27.467854Z",
            "website": null
        }
    ]
}