{
    "psychology": [
        {
            "id": 6,
            "category": {
                "id": 7,
                "title": "Psychology",
                "categoryDesc": "Evergreen psychology blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Psychology-Psychology.png"
            },
            "author": {
                "id": 11,
                "role": "Biographer",
                "name": "Olivia Bennett",
                "profile": "/images/circleProfiles/cropped_image_20.png",
                "about_me": "Olivia Bennett writes compelling biographies that bring her subjects to life. Her meticulous research and engaging prose make her books both informative and enjoyable.",
                "linkedin": "https://linkedin.com/in/oliviabennett",
                "instagram": "https://instagram.com/oliviabennett",
                "twitter": "https://twitter.com/oliviabennett",
                "youtube": "https://youtube.com/oliviabennett"
            },
            "title": "How to cope up with nightmares",
            "body": "For many people, nightmares are a major barrier to a good night’s sleep. Getting enough sleep is necessary for your body to operate as it should. While the amount of sleep you need differs from person to person, it’s generally recommended that adults get between 7 to 9 hours of sleep a night.  In today’s fast-paced world, it’s common to “get by” on a lot less. Many people are so sleep-deprived, they don’t even notice the effects on their bodies! Some people even brag about how little they sleep, or how they “run on coffee”. \r\n\r\nSleep is so essential, that not getting enough sleep is correlated to everything from weight gain, to heart disease, weakening of the immune system, distractibility that can lead to increased risk of accidents, and much more. \r\n\r\nNightmares in adults can be caused by certain types of medication; PTSD, depression, anxiety or sleep disorders; stress and more. \r\n\r\nWhat can you do when you’re struggling with sleep deprivation due to recurring nightmares?\r\n\r\n●Get out of bed. Don’t torture yourself by lying in bed for hours after waking up from a nightmare. If you can’t fall back asleep, get out of bed. Make yourself some chamomile tea, go for a five-minute walk or take a shower. Doing this can give your body and mind a kind of “reset” that will help you fall back asleep quickly. \r\n●Keep a dream journal. When you wake up from a dream, write down everything you can remember about it. You’ll probably find out common themes that keep showing up in the nightmares. When you identify these themes, you can look closely at your life and deal with the issues. \r\n●Talk it out. Bottling things up makes them have a stronger hold on you. In addition to the relief you’ll feel from letting things out, talking to someone else about your nightmares can offer you a different perspective, and perhaps some solution. Maybe you see no connection between your dreams and what’s going on in your life. A friend or therapist can offer some ideas. \r\n●Practice good sleep hygiene. Some people report having nightmares after eating too close to bedtime. Making sure you have a regular sleeping schedule and practice sleep hygiene can improve your overall quality of sleep. Make sure you only use your bed for sleeping and having sex. Eat your last meal several hours before going to bed, and avoid screens (TV, computers, and smartphones) for at least an hour before going to sleep. Keep your room well ventilated and make sure it is not too hot or cold. \r\n●Take active steps to reduce stress in your life. Whether that’s making sure you don’t bite off more than you can chew (you really don’t have to accept every invitation) or adopting new stress-busting habits, this is an important step. Stress is one of the main causes of nightmares in adults. Yoga isn’t the only thing you can do. Try different forms of exercise, breathing techniques, and meditation. \r\n●See a specialist. If your nightmares are recurring and are seriously getting in the way of your everyday life, it’s time to see a specialist. First, you can discuss with your doctor if any medication you take might be the cause of your nightmares and find another course of action. If you’re not on any medication or are unable to change the medication you take, your doctor might refer you to a sleep specialist. \r\n\r\nDealing with recurring nightmares is a horrible experience. The stress from experiencing nightmares can unfortunately make nightmares even more likely to occur. We hope that these tips can help you break out of this negative pattern.",
            "excerpt": "For many people, nightmares are a major barrier to a good night’s sleep. Getting enough sleep is necessary for your body to operate as it should.",
            "tags": "nightmares,coping,therapist",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/How_to_cope_up_with_nightmares-How_to_cope_up_with_nightmares.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T05:58:40.408227Z",
            "website": null
        },
        {
            "id": 5,
            "category": {
                "id": 7,
                "title": "Psychology",
                "categoryDesc": "Evergreen psychology blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Psychology-Psychology.png"
            },
            "author": {
                "id": 12,
                "role": "Self-Help Author",
                "name": "Kevin Smith",
                "profile": "/images/circleProfiles/cropped_image_21.png",
                "about_me": "Kevin Smith offers practical advice and inspiration through his self-help books. His positive and encouraging approach has helped countless readers achieve their personal and professional goals.",
                "linkedin": "https://linkedin.com/in/kevinsmith",
                "instagram": "https://instagram.com/kevinsmith",
                "twitter": "https://twitter.com/kevinsmith",
                "youtube": "https://youtube.com/kevinsmith"
            },
            "title": "Why do I keep having nightmares",
            "body": "Many adults and children suffer from nightmares. While nightmares are more common in children, up to 85% of adults report that they sometimes have nightmares. That fact offers little comfort to the person who is waking up in the middle of the night in a panic. It’s not only the fact that nightmares are unpleasant. Having nightmares can lead to a lack of sleep. Often, people will feel that they are unable to fall back asleep after a nightmare. The resulting sleep deprivation can cause all sorts of problems. From a lack of focus at work to an increase in the risk of car accidents and even disease. Not getting enough sleep can be risky.\r\n\r\nBecause nightmares often lead to sleep deprivation, it increases the stress in our daily life. Of course, more stress in life increases the risk of having more nightmares. To the nightmare suffer, it seems to be an endless loop with no end in sight.\r\n\r\nTo stop having nightmares, it is important to understand why we have them in the first place. Yet, sometimes it is hard to understand why the nightmares come. They seem to appear out of nowhere and will take up residence in our sleep for days, weeks or even months at a time. We want to get rid of them - but it’s hard to know where to start if we don’t understand why they appear in the first place!\r\n\r\nSo, Why Do I Keep Having Nightmares?\r\n\r\nSeveral potential causes of nightmares have been identified, based on people’s reports and scientific studies. \r\n\r\n●Medication. Certain types of medication can cause nightmares as a side effect. Many types of medications can interfere with dreams. For example, anti-depressants such as SSRIs, medication for blood pressure (beta-blockers) or cholesterol, medication for Alzheimer’s and Parkinson's, sleeping aids and more. Please consult your doctor if you are currently taking any medication and suspect that they might be contributing to your nightmares. Keep in mind that withdrawal from medication can also cause nightmares. \r\n●Was It Something You Ate? Some people report having nightmares when they eat right before sleep, or when they eat certain foods. Cheese and other dairy products, foods high in sugar, and spicy food have all been reported to cause nightmares in some. Alcohol can also be a cause of stressful dreams and nightmares. You can start to keep a food and sleep blog to notice any trends between what you consume and what you dream.\r\n●Stress and trauma. Many people start having nightmares after going through a traumatic experience, such as a car accident, physical assault, or military service. For others, it is not a single traumatic event but a period of stress. It’s not a coincidence that university students tend to have nightmares around the exam period or that others experience bad dreams during a busy time at work when they are working long hours.\r\n●Depression, anxiety, PTSD and sleep disorders. Some people struggle with certain conditions in their day to day life that make nightmares more likely. Sleep apnea and restless leg syndrome have been linked to increased nightmares. If nightmares are recurring, they can themselves be classified as a disorder. Getting a diagnosis and treatment for these underlying conditions and reduce the frequency of the nightmares.\r\n\r\nIf you have regular nightmares (once a week or more), your nightmares are severe, or you are unable to understand why you have nightmares, it may be time to see a specialist. You can make an appointment with a sleep clinic. There, you can undergo tests and a specialist can help you come up with possible solutions.",
            "excerpt": "Many adults and children suffer from nightmares. While nightmares are more common in children, up to 85% of adults report that they sometimes have nightmares.",
            "tags": "nightmares,sleep,dreams",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Why_do_I_keep_having_nightmares-Why_Do_I_Keep_Having_Nightmares.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T05:57:38.321733Z",
            "website": null
        },
        {
            "id": 4,
            "category": {
                "id": 7,
                "title": "Psychology",
                "categoryDesc": "Evergreen psychology blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Psychology-Psychology.png"
            },
            "author": {
                "id": 13,
                "role": "Travel Writer",
                "name": "Emily Jones",
                "profile": "/images/circleProfiles/cropped_image_22.png",
                "about_me": "Emily Jones takes readers on a journey through her travel writing, exploring new cultures and destinations with vivid descriptions and insightful observations.",
                "linkedin": "https://linkedin.com/in/emilyjones",
                "instagram": "https://instagram.com/emilyjones",
                "twitter": "https://twitter.com/emilyjones",
                "youtube": "https://youtube.com/emilyjones"
            },
            "title": "Why do we have bad dreams",
            "body": "Every night we go to sleep and we dream.  We dream every time we sleep. While some people say they don’t dream, the truth is they likely don’t remember their dreams. We tend to have around four to six dreams a night, mainly during the REM (rapid eye movement) stage of sleep. \r\n\r\nSome people remember their dreams often, whilst others rarely do. Dreams are easier to remember when they are particularly vivid or emotional. That's why people find it easier to recall recurring dreams, bad dreams or nightmares. Unfortunately, bad dreams are unpleasant - and being able to remember them isn't a big enough perk.\r\n\r\nMost people who have bad dreams would like to stop having them. The problem arises because our dreams are out of our direct control. Sigmund Freud, one of the most influential people in the field of Psychology, claimed our dreams are a representation of repressed desires. By working with a psychoanalyst, one could understand their hidden desires and solve the problem. Thus, they would be able to stop having bad dreams. Whilst many of Freud’s theories have been discredited, there seems to be a lot behind his theory of repression and dreams. \r\n\r\nBad dreams and nightmares are a common symptom of PTSD (post-traumatic stress disorder). Up to 96% of people diagnosed with PTSD suffer from nightmares. These nightmares often include re-experiencing the trauma at the root of their PTSD. Of course, it doesn’t take a PTSD diagnosis to have bad dreams. People from all over the world have bad dreams during different parts of their lives. 50-85% of adults reported having nightmares. Between 2% and 8% seem to have nightmares regularly. \r\n\r\nThe terms bad dreams and nightmares are often used interchangeably. By definition, people wake up from nightmares but sleep through bad dreams. That said, the line between bad dreams and nightmares is quite thin. At the end of the day, there is not much difference between them. People report common themes in nightmares and bad dreams. The death of a close person or the sensation of someone chasing you are frequent themes. Often, bad dreams are recurring. People will have the same dream over and over, or the same general story with several variations. For example, someone might dream of several different ways they fail a test. One night they might dream they show up to the test without pencils. The next week they might dream that they only found out about a test an hour before. Often, people wake up from bad dreams and are unable to fall asleep again because they feel disturbed. \r\n\r\nWhy do we have bad dreams? \r\nWith all that said, what is the reason we have bad dreams and nightmares? Some medications (like anti-depressants and blood pressure medications) can increase the frequency of bad dreams. Other substances, like alcohol, can have a similar effect.\r\n\r\nIf you’re not taking any medication or drinking alcohol, there are other causes to look at. \r\n\r\nSleep deprivation can also increase the likelihood of bad dreams. Unfortunately, nightmares can interfere with sleep and cause even more sleep deprivation.\r\n\r\nAs mentioned, PTSD can cause nightmares in adults. Depression and anxiety can also increase the likelihood of bad dreams, as can general life stress. A busy time at work or a big fight with a family member can influence our dreams. Even if the stressful events in our lives aren’t the topic of our bad dreams, they can still be the cause.\r\n\r\nOf course, it’s impossible to completely prevent stress in our lives. In fact, some stress can be positive. So what can we do to prevent bad dreams from appearing?\r\n\r\nLike Freud suggested, things from our daily lives are more likely to show up in bad dreams if we try to ignore them. Having a safe space to reflect on the events in our lives is important, and can cut down on or even prevent bad dreams. \r\n\r\nUnderstanding the cause of the bad dreams in our lives is an important step to getting a peaceful nights’ sleep.",
            "excerpt": "Every night we go to sleep and we dream.  We dream every time we sleep. While some people say they don’t dream, the truth is they likely don’t remember their dreams.",
            "tags": "bad dreams, sleep,night",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Why_do_we_have_bad_dreams-Why_do_we_have_bad_dreams.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T05:56:32.592306Z",
            "website": null
        },
        {
            "id": 3,
            "category": {
                "id": 7,
                "title": "Psychology",
                "categoryDesc": "Evergreen psychology blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Psychology-Psychology.png"
            },
            "author": {
                "id": 14,
                "role": "Cookbook Author",
                "name": "Mia Johnson",
                "profile": "/images/circleProfiles/cropped_image_23.png",
                "about_me": "Mia Johnson shares her passion for cooking through her beautifully crafted cookbooks. Her recipes are known for their creativity and accessibility, inspiring home cooks everywhere.",
                "linkedin": "https://linkedin.com/in/miajohnson",
                "instagram": "https://instagram.com/miajohnson",
                "twitter": "https://twitter.com/miajohnson",
                "youtube": "https://youtube.com/miajohnson"
            },
            "title": "How to overcome bad dreams at night",
            "body": "Bad dreams can be a real burden. Waking up sweating, with your heart pounding, unable to fall back asleep for hours at a time. Many develop sleeping anxiety and start to suffer from insomnia. Lying awake for hours, with nothing to look forward to but waking up shortly after falling asleep from another nightmare, can seem like torture. \r\n\r\nBeyond the unpleasantness of it, suffering from bad dreams can lead to sleep deprivation, which is downright dangerous. While eight hours of sleep is recommended, many people get much less on a daily basis. After several days of not getting enough sleep, tiredness and brain fog increases - as does your risk of accidents. \r\n\r\nSleep is essential to keep your body running optimally, and when you don’t get enough sleep, all systems start to suffer. Sleep deprivation can cause issues within your digestive system and immune system. That can lead to weight gain and susceptibility to various diseases and illnesses. Sleep deprivation is correlated with heart disease, diabetes, and more.\r\n\r\nEven if you know how essential sleep it, it can be hard to get enough when you are suffering from constant bad dreams. Here are some tips to minimize the appearance of bad dreams in your life. We hope it helps.\r\n\r\n●Timing Matters… Don’t eat right before going to sleep. Many people report a correlation between eating at bedtime and having bad dreams. Have a regular bedtime, and make sure to eat dinner at least two hours before. \r\n●...And So Does Content. Make sure your last meal is healthy, and not too heavy. Avoid alcohol, dairy, sugary foods (like cake, cookies and ice cream), white bread and pasta. Try a meal rich in vegetable and complex carbs like whole grains or potatoes. For example, try a big quinoa salad, or a baked potato with non-spicy lentil curry. Almonds and chamomile tea are reported to be sleep-promoting.\r\n●Practice sleep hygiene. Try to avoid screens for at least an hour before going to bed. Make sure your room is well ventilated and try to keep your sleeping hours as regular as possible. Use your bed for sleep (and sex) only. Find another place to work and study. It’s worth it.\r\n●Air out your troubles. Stress and repressed feelings are a major cause of nightmares. Therapy, a journaling practice and talking to trusted people about your problems may alleviate some of your concerns. This way, your problems are less likely to show up in your sleep.\r\n●Breathing practices and meditation. Take measures to find a practice to help you manage the stress in your daily life. Apps like Insight Talmer, Headspace and Calm have guided meditations that can help you relax and drift off to sleep.\r\n●Exercise. Cardiovascular exercise is known to improve quality of sleep. It works not only by reducing the amount of stress in your life but also helps regulate your cardiovascular system. Remember thatit might take several weeks until you feel the benefits of exercise on the quality of your sleep. Try to exercise early in the day, as the adrenaline from exercise can make it harder on some to fall asleep when they workout too close to bedtime. \r\n●Talk about the dream and rewrite the ending. When you have recurring bad dreams, it might be helpful to consider different ways the dream could have gone. Write down your dream and then think about different ways the dream could have gone. Let’s say you have a dream in which you are attacked by a bear. When you write or think about this dream, you can practice thinking about the bear as a puppy or giant teddy bear instead. If you have a dream that your teacher fails you because you brought in the wrong pencil, you can imagine confronting them. Practicing these alternatives frequently enough can bring them into your dreams the next time they occur. You can do this by yourself or with a trained therapist.\r\n\r\nIf the above suggestions don’t offer you any relief, it may be time to see a sleep specialist. In a sleep clinic, a specialist will monitor your sleep and will be able to offer you alternative solutions, such as medication, CBT (Cognitive Behavioral Therapy) and more.",
            "excerpt": "Bad dreams can be a real burden. Waking up sweating, with your heart pounding, unable to fall back asleep for hours at a time. Many develop sleeping anxiety and start to suffer from insomnia.",
            "tags": "bad dreams, dreams, sleep,night",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/How_to_overcome_bad_dreams_at_night-How_to_overcome_bad_dreams_at_night_.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T05:54:45.899498Z",
            "website": null
        },
        {
            "id": 2,
            "category": {
                "id": 7,
                "title": "Psychology",
                "categoryDesc": "Evergreen psychology blogs.",
                "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Psychology-Psychology.png"
            },
            "author": {
                "id": 15,
                "role": "Horror Writer",
                "name": "Lucas Evans",
                "profile": "/images/circleProfiles/cropped_image_24.png",
                "about_me": "Lucas Evans writes chilling horror novels that captivate and terrify readers. His mastery of suspense and atmosphere creates unforgettable reading experiences.",
                "linkedin": "https://linkedin.com/in/lucasevans",
                "instagram": "https://instagram.com/lucasevans",
                "twitter": "https://twitter.com/lucasevans",
                "youtube": "https://youtube.com/lucasevans"
            },
            "title": "How to stop recurring dreams and why do we have them",
            "body": "Bad dreams are exactly what the name suggests - dreams that we wake up from feeling anxious, scared, sad, or even disgusted. Pretty straightforward. Recurring dreams are dreams that keep coming back to us in our life. When bad dreams become recurring, they can cause a lot of stress and lead to sleep deprivation. In turn, sleep deprivation is a major risk to our health, being linked to everything from weight gain to heart disease. \r\n\r\nWe know you just want to learn how to stop these dreams from happening, so let’s have a closer look at what they are and how you can stop them.\r\n\r\nWhy Do We Have Recurring Dreams?\r\n\r\nThe most common theory is that recurring dreams occur from stress in our daily life, or from childhood traumas (or both). There are common themes that many people dream about. For example, many people report dreams such as getting to an exam and realizing they haven’t studied - even years after they have finished school! Others have dreams about being chased, attacked or falling.\r\n\r\nMany theories suggest that dreams have an adaptive purpose. They help us work through the events in our lives and better prepare for future threats. Some say that “practicing” possible situations through recurring dreams allows us to make better choices, should these scenarios actually occur. \r\n\r\nA theory popularized by Freud is that dreams are a reflection of our suppressed feelings, fears, and desires. Studies have found that ongoing stress is felt in our body and can lead to an increase in bad dreams, nightmares, and insomnia.\r\n\r\nSo, how can we stop having recurring dreams?\r\n\r\nStart with keeping a dream journal. It will help you see if your dreams really are recurring, and what are the themes and details that keep popping up in them. That will give you your first clues about what is causing these dreams to keep on appearing. Keep a notebook and pen beside your bed, so you can write as soon as you wake up. Include the date and as many details as you can remember about your dream.\r\n\r\nConsider what is bringing you stress in your daily life, or what you might be trying to suppress. Everyone has things we’d rather not think about, but if we refuse to give them any space at all, they will find some other way to be on our mind.  It can help to set aside a certain amount of time to think about what it is that is worrying you. Then, after your “worry hour” is up, you can go back to trying to avoid the topic.\r\n\r\nTalk about the things that are bothering you. The less you bottle up inside, is one less thing that will need to find some other creative way to pop up. Whether it’s the dreams themselves or what you suspect is causing them, it can help to get it off your chest. You might surprise yourself by how good it feels.\r\n\r\nDon’t forget to take care of your body. Exercising regularly and eating a clean, healthy diet will help regulate the stress hormones in your body, making you less likely to get bad dreams. Pay extra close attention to what you eat before going to bed. Some people say that certain foods - like cheese, spicy food, or white flour such as bread and pasta - make them more likely to have bad dreams.\r\n\r\nTake up activities to reduce stress in your life, such as yoga, meditation and breathing exercises. Similarly to exercise, this will calm your body down and help you achieve deeper, more relaxing sleep.\r\n\r\nIt might take some time until you feel the effects, but if you practice these habits consistently, your sleep quality can improve.",
            "excerpt": "Bad dreams are exactly what the name suggests - dreams that we wake up from feeling anxious, scared, sad, or even disgusted. Pretty straightforward. Recurring dreams are dreams that keep coming back to us in our life.",
            "tags": "dreams, bad dreams,recurring dreams",
            "contentSourceName": null,
            "contentSourceURL": null,
            "extraImageUrl": null,
            "extraImageAttribution": null,
            "imageOwnerName": null,
            "imageOwnerBacklink": null,
            "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/How_to_stop_recurring_dreams_and_why_do_we_have_them-How_to_stop_recurring_dr_3Dxpx0C.jpg",
            "videoURL": null,
            "date_published": "2022-08-20T05:53:44.517614Z",
            "website": null
        }
    ]
}